# Consulta a pandas DataFrame 

Devolver una porción de los datos en un DataFrame se llama cortar o cortar los datos

Hay muchas maneras diferentes de consultar a un pandas DataFrame, aquí hay algunas para empezar

In [1]:
import pandas as pd

In [3]:
airports = pd.DataFrame([
                        ['Seatte-Tacoma', 'Seattle', 'USA'],
                        ['Dulles', 'Washington', 'USA'],
                        ['London Heathrow', 'London', 'United Kingdom'],
                        ['Schiphol', 'Amsterdam', 'Netherlands'],
                        ['Changi', 'Singapore', 'Singapore'],
                        ['Pearson', 'Toronto', 'Canada'],
                        ['Narita', 'Tokyo', 'Japan']
                        ],
                        columns = ['Name', 'City', 'Country']
                        )
airports

              Name        City         Country
0    Seatte-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

## Devuelve una columna
Especifique el nombre de la columna que desea devolver
* *DataFrameName*['*columnName*']

In [4]:
airports['City']

0       Seattle
1    Washington
2        London
3     Amsterdam
4     Singapore
5       Toronto
6         Tokyo
Name: City, dtype: object

## Devuelve varias columnas
Proporcione una lista de las columnas que desea devolver
* *DataFrameName*['*FirstColumnName*','*SecondColumnName*',...]]

In [5]:
airports[['Name', 'Country']]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan

## Usando *iloc* para especificar filas y columnas a devolver
**iloc**[*rows*,*columns*] le permite acceder a un grupo de filas o columnas por posiciones de índice de fila y columna.

Especifique la fila y columna específicas que desea devolver
* La primera fila es la fila 0
* La primera columna es la columna 0

In [7]:
# Devuelve el valor en la primera fila, primera columna
airports.iloc[0,0]

'Seatte-Tacoma'

In [8]:
# Devuelve el valor en la tercera fila, tercera columna
airports.iloc[2,2]

'United Kingdom'

Un valor de *:* devuelve todas las filas o todas las columnas

In [9]:
airports.iloc[:,:]

              Name        City         Country
0    Seatte-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands
4           Changi   Singapore       Singapore
5          Pearson     Toronto          Canada
6           Narita       Tokyo           Japan

Puede solicitar un rango de filas o un rango de columnas
* [x:y] devolverá filas o columnas x a través de y

In [10]:
# evuelve las dos primeras filas y muestra todas las columnas
airports.iloc[0:2,:]

            Name        City Country
0  Seatte-Tacoma     Seattle     USA
1         Dulles  Washington     USA

In [11]:
# Devuelve todas las filas y muestra las dos primeras columnas
airports.iloc[:,0:2]

              Name        City
0    Seatte-Tacoma     Seattle
1           Dulles  Washington
2  London Heathrow      London
3         Schiphol   Amsterdam
4           Changi   Singapore
5          Pearson     Toronto
6           Narita       Tokyo

Puede solicitar una lista de filas o una lista de columnas
* [x,y,z] devolverá filas o columnas x,y, y z

In [12]:
airports.iloc[:,[0,2]]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan

## Usar *loc* para especificar columnas por nombre
Si desea enumerar los nombres de columna en lugar de las posiciones de columna, utilice **loc** en lugar de **iloc**

In [13]:
airports.loc[:,['Name', 'Country']]

              Name         Country
0    Seatte-Tacoma             USA
1           Dulles             USA
2  London Heathrow  United Kingdom
3         Schiphol     Netherlands
4           Changi       Singapore
5          Pearson          Canada
6           Narita           Japan